In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'date': ['2021-01-01', '2021-01-01', '2021-01-01', '2021-01-02', '2021-01-02'], 
                   'category': ['Авто', 'Дача', 'Дача', 'Авто', 'Дача'],
                   'cost': [100, 200, 300, 400, 500]})
df

         date category  cost
0  2021-01-01     Авто   100
1  2021-01-01     Дача   200
2  2021-01-01     Дача   300
3  2021-01-02     Авто   400
4  2021-01-02     Дача   500

In [6]:
100+400

500

In [4]:
100+200+300

600

In [6]:
df.groupby(['date', 'category']).sum()

                     cost
date       category
2021-01-01 Авто       100
           Дача       500
2021-01-02 Авто       400
           Дача       500

In [5]:
df.groupby(['date', 'category']).sum().reset_index()

         date category  cost
0  2021-01-01     Авто   100
1  2021-01-01     Дача   500
2  2021-01-02     Авто   400
3  2021-01-02     Дача   500

In [15]:
def test_calc(cost):
    return cost.mean()

In [26]:
df.pivot_table(index='date', columns='category', values='cost', aggfunc='sum')

category    Авто  Дача
date
2021-01-01   100   500
2021-01-02   400   500

In [41]:
dataframe = df.groupby('category').count()
dataframe = dataframe.reset_index()

In [42]:
dataframe

  category  date  cost
0     Авто     2     2
1     Дача     3     3

In [43]:
dataframe.set_index('category')

          date  cost
category
Авто         2     2
Дача         3     3

In [46]:
dataframe.index = ['a', 'z']
dataframe

  category  date  cost
a     Авто     2     2
z     Дача     3     3